/////////////////////////////////////////////////////////////////////////////////////////////
//  SPS Technology :: 2016  /////////////////////////////  Smart Motion Sensor TestPattern //
/////////////////////////////////////////////////////////////////////////////////////////////
#define frameX 176      // Разрешение по горизонтали
#define frameY 144      // Разрешение по вертикали
#define pxls frameX*frameY
int j;

const unsigned char trio [] = {
//
};


//////////////////////////////////////  ИНИЦИАЛИЗАЦИЯ  ///////////////////////////////////////
void setup() {
  Serial.begin(234000);
}
//////////////////////////////////////  ОСНОВНОЙ ЦИКЛ  //////////////////////////////////////
void loop()
{
  Serial.write(255);                     // Отправляем тестовый градиент
  
    for (int i = 0;i <pxls; i++)
  {
    Serial.write(random(0, 250));
   // Serial.write(j);
   //  Serial.write(trio[i]);
  }
  j+=10;
}
/////////////////////////////////////////////////////////////////////////////////////////////
/*
  for (int i = 0;i <pxls; i++)
  {
    ter[i] = random(0, 225);
  }
  Serial.write(ter, pxls);
*/  
/*  
  Serial.write(255);                     // Отправляем тестовый градиент
  for (int i = 0;i <225; i++)
  {
    ter[i] = i;
  }
  Serial.write(ter, 225);
  */



